Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.CheckExtractedDrawingData(System.String,System.Action{System.String})
Diagnose whether drawing data extraction worked successfully.
resultString: Return value from core extraction function
logger: Callback to output error messages
Throws System.ApplicationException: Thrown when extraction has failed
Returns: True if the extraction was successful for at least one drawing, false otherwise

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.SanityCheckExtractedAssemblyData(System.Int32)
Diagnose whether drawing data extraction worked successfully.
numberOfAssemblies: Number of assemblies that were selected for extraction
Throws System.ApplicationException: Thrown when extraction has failed